In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[6,7,8,9,10]})
var

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [16]:

var #shit ! IDK what is happened with this code .. leave it

   A  python_1  python_  py  python   B
0  1         1        1   1       1   6
1  2         2        2   2       2   7
2  3         3        3   3       3   8
3  4         4        4   4       4   9
4  5         5        5   5       5  10

In [18]:
var1 = pd.DataFrame({"X": [1,2,3,4,5],"Y": [6,7,8,9,10]})
var1

   X   Y
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [19]:
# insert some datas in separate column using slicing 

var1["slice"] = var1["X"][:4]
var1

   X   Y  slice
0  1   6    1.0
1  2   7    2.0
2  3   8    3.0
3  4   9    4.0
4  5  10    NaN

# Delete

In [21]:
# let's make a separated DataFrame for it ____________________

datFr = pd.DataFrame({"dat1":[1,2,3,4],"dat2": [5,6,7,8],"dat3":[10,11,12,13]})
datFr

   dat1  dat2  dat3
0     1     5    10
1     2     6    11
2     3     7    12
3     4     8    13

In [28]:
datFr
# some error to show the code 

#syntax :  name_of_dataframe.pop("column_name")
# OR :  del name_of_dataframe.pop("column_name")

   dat1  dat3
0     1    10
1     2    11
2     3    12
3     4    13

In [29]:
del datFr["dat1"]
datFr

   dat3
0    10
1    11
2    12
3    13

## Okay Bye !!!

##### sudeep